TexhFexLabs/HydroNodeStation/stm32_node/LoRaWAN/App/lora_app.c
/* USER CODE END PB_Callbacks */

static void SendTxData(uint8_t port)
{
  /* USER CODE BEGIN SendTxData_1 */
  sensor_t sensor_data;
  uint8_t bufferSize = 0;

  /* Increment tx_counter */
  tx_counter++;
  if (tx_counter > 6U)
  {
    tx_counter = 1U;
  }

  /* Determine which sensors to read this cycle */
  uint8_t sensor_flags = 0U;
  if (tx_counter % 3U == 0U) { sensor_flags |= SENSOR_FLAG_CO2; }
  if (tx_counter % 6U == 0U) { sensor_flags |= SENSOR_FLAG_SPS30; }

  /* Read sensors */
  EnvSensors_Read(&sensor_data, sensor_flags);

  APP_LOG(TS_ON, VLEVEL_M, "Sensors: T=%d.%d degC, RH=%d.%d%%, P=%d hPa, VBAT=%d.%03d V, CO2=%u ppm\r\n",
          (int)sensor_data.temperature, (int)(sensor_data.temperature * 10) % 10,
          (int)sensor_data.humidity, (int)(sensor_data.humidity * 10) % 10,
          (int)sensor_data.pressure,
          (int)sensor_data.battery_voltage, (int)(sensor_data.battery_voltage * 1000) % 1000,
          (unsigned int)sensor_data.co2_ppm);

  enum
  {
    LPP_CH_PRESSURE = 0,
    LPP_CH_TEMPERATURE,
    LPP_CH_HUMIDITY,
    LPP_CH_UV_RAW,
    LPP_CH_BATTERY_V,
    LPP_CH_CO2,
  };

  CayenneLppReset();
  CayenneLppAddBarometricPressure(LPP_CH_PRESSURE, sensor_data.pressure);
  CayenneLppAddTemperature(LPP_CH_TEMPERATURE, sensor_data.temperature);
  CayenneLppAddRelativeHumidity(LPP_CH_HUMIDITY, sensor_data.humidity);
  CayenneLppAddLuminosity(LPP_CH_UV_RAW, (uint16_t)sensor_data.uv_raw);
  CayenneLppAddAnalogInput(LPP_CH_BATTERY_V, sensor_data.battery_voltage);
  CayenneLppAddLuminosity(LPP_CH_CO2, sensor_data.co2_ppm);

  CayenneLppCopy(AppDataBuffer);
  bufferSize = CayenneLppGetSize();

  if (JoinLedTimer.IsRunning)
  {
    UTIL_TIMER_Stop(&JoinLedTimer);
    HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, GPIO_PIN_RESET);
  }

  ASSERT_SMTC_MODEM_RC(smtc_modem_request_uplink(STACK_ID, port, false, AppDataBuffer, bufferSize));

  if (EventType == TX_ON_TIMER)
  {
    smtc_modem_status_mask_t status_mask = 0;
    smtc_modem_get_status(STACK_ID, &status_mask);
    uint32_t dutycycle = (CertMode || ((status_mask & SMTC_MODEM_STATUS_JOINED) != SMTC_MODEM_STATUS_JOINED)) ? CERT_TX_DUTYCYCLE : APP_TX_DUTYCYCLE;

    ASSERT_SMTC_MODEM_RC(smtc_modem_alarm_start_timer(dutycycle));

    /* Schedule pre-measurement for next TX if it will be a CO2 cycle */
    uint8_t next_counter = (tx_counter % 6U) + 1U;
    if (next_counter % 3U == 0U)
    {
      UTIL_TIMER_SetPeriod(&Scd41Timer, (dutycycle * 1000U) - SCD41_PRE_MEASUREMENT_TIME_MS);
      UTIL_TIMER_Start(&Scd41Timer);
    }

    if (next_counter % 6U == 0U)
    {
      /* dummy: start SPS30 timer */
    }
  }
  /* USER CODE END SendTxData_1 */
}

/* USER CODE BEGIN PrFD_LedEvents */
static bool IsAllZero(const uint8_t *buffer, uint8_t size)
{
  for (uint8_t i = 0; i < size; i++)
  {
    if (buffer[i] != 0U)
    {
      return false;
    }
  }

  return true;
}

static void OnTxTimerLedEvent(void *context)
{
  HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_RESET); /* LED_GREEN */
}

static void OnRxTimerLedEvent(void *context)
{
  //HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_RESET); /* LED_BLUE */
}

static void OnJoinTimerLedEvent(void *context)
{
  HAL_GPIO_TogglePin(LED3_GPIO_Port, LED3_Pin); /* LED_RED */
}

static void OnScd41TimerEvent(void *context)
{
  APP_LOG(TS_ON, VLEVEL_M, "SCD41 pre-measurement started\r\n");
  EnvSensors_StartPreMeasurement(SENSOR_FLAG_CO2);
}

/* USER CODE END PrFD_LedEvents */

#if defined (LOW_POWER_DISABLE) && (LOW_POWER_DISABLE == 0)
static void OnSleepTimerEvent(void *context)
{
  /* USER CODE BEGIN OnSleepTimerEvent_1 */

  /* USER CODE END OnSleepTimerEvent_1 */
  APP_LOG(TS_ON, VLEVEL_H, "Sleep timer\r\n");

  /* USER CODE BEGIN OnSleepTimerEvent_Last */

  /* USER CODE END OnSleepTimerEvent_Last */
}
#endif /*(LOW_POWER_DISABLE) && (LOW_POWER_DISABLE == 0) */

/* --- EOF ------------------------------------------------------------------ */
